{"type":"table","name":"A","database":"food","data":
[
{"id":"1","name":"Bánh cuốn","description":"Bánh cuốn is made from a thin, wide sheet of fermented[2] rice batter filled with a mixture of cooked seasoned ground pork, minced wood ear mushroom, and minced shallots. Sides for this dish usually consist of chả lụa (Vietnamese pork sausage), sliced cucumber, and bean sprouts, with the dipping sauce which is fish sauce called nước chấm (Nuoc Mam).","type":"food","type2":"","countryId":"1","energy":"300","protein":"18","carbohydrate":"20","lipid":"10","allergy":"wheat"},
{"id":"2","name":"Phở","description":"Vietnamese soup dish consisting of broth, rice noodles (bánh phở), herbs, and meat (usually beef (phở bò), sometimes chicken (phở gà)).[4][5] Pho is a popular food in Vietnam[6] where it is served in households, street stalls and restaurants countrywide. Pho is considered Vietnam's national dish","type":"food","type2":"","countryId":"1","energy":"260","protein":"20","carbohydrate":"18","lipid":"13","allergy":"wheat,beef"},
{"id":"3","name":"Bún chả","description":" Vietnamese dish of grilled pork and noodle, which is thought to have originated from Hanoi, Vietnam.[1] Bún chả is served with grilled fatty pork (chả) over a plate of white rice noodle (bún) and herbs with a side dish of dipping sauce. The dish was described in 1959 by Vietnamese food writer Vu Bang (1913–1984), who described Hanoi as a town \"transfixed by bún chả.\" Hanoi's first bún chả restaurant was on Gia Ngư, Hoàn Kiếm District, in Hanoi's Old Quarter.","type":"food","type2":"","countryId":"1","energy":"298","protein":"25","carbohydrate":"21","lipid":"22","allergy":"beef,wheat"},
{"id":"4","name":"Gỏi cuốn","description":"Vietnamese dish traditionally consisting of pork, prawn, vegetables, bún (rice vermicelli), and other ingredients wrapped in Vietnamese bánh tráng (commonly known as rice paper or cold roll).[8][9] Unlike other spring roll dishes which are believed to be originated from China, Vietnamese gỏi cuốn is the country's creation using rice paper .","type":"food","type2":"fast food","countryId":"1","energy":"112","protein":"14","carbohydrate":"9","lipid":"6","allergy":"wheat,shirmp,beef"},
{"id":"5","name":"Bánh mì","description":"Vietnamese: [ɓǎjŋ̟ mî], \"bread\") is a short baguette with thin, crisp crust and soft, airy texture. It is often split lengthwise and filled with savory ingredients like a submarine sandwich and served as a meal, called bánh mì thịt. Plain banh mi is also eaten as a staple food.","type":"food","type2":"fast food","countryId":"1","energy":"277","protein":"28","carbohydrate":"22","lipid":"24","allergy":"wheat"},
{"id":"6","name":"Cá kho tộ","description":"cá kho or cá kho tộ (tộ referring to the clay pot in which the dish is cooked). For fish stew, catfish is preferred, particularly in southern Vietnam","type":"food","type2":"","countryId":"1","energy":"210","protein":"30","carbohydrate":"12","lipid":"28","allergy":"peanuts"},
{"id":"7","name":"Bánh xèo","description":" is a crispy, stuffed rice pancake popular in Vietnam.[1] The name refers to the sound (from xèo – 'sizzling') the rice batter makes when it is poured into the hot skillet.[2][3] It is a savoury fried pancake made of rice flour, water, and turmeric powder. It can also be called a Vietnamese crêpe.[4][5] Some common stuffings include pork, prawns, diced green onion, mung bean, and bean sprouts. Bánh xèo is also served with lettuce, mint, Asian basil, and fish mint","type":"food","type2":"fast food","countryId":"1","energy":"220","protein":"16","carbohydrate":"15","lipid":"12","allergy":"wheat,peanuts,shirmp"},
{"id":"8","name":"Canh chua","description":"or cá nấu (\"cooked fish\") is a Vietnamese sour soup indigenous to the Mekong Delta region of Southern Vietnam (Note, Northern and Central Vietnam also have their own canh chua). It is typically made with fish from the Mekong River Delta, pineapple, tomatoes (and sometimes also other vegetables such as đậu bắp or dọc mùng), and bean sprouts, in a tamarind-flavored broth. It is garnished with the lemony-scented herb ngò ôm (Limnophila aromatica), caramelized garlic, and chopped scallions, as well as other herbs, according to the specific variety of canh chua; these other herbs may include rau răm (Vietnamese coriander), ngò gai (long coriander), and rau quế (Thai basil). It can be served alone, with white rice, or with rice vermicelli. Variations can include prawns, squid, spare ribs, fish cakes and quail eggs.","type":"food","type2":"soup","countryId":"1","energy":"160","protein":"28","carbohydrate":"10","lipid":"20","allergy":null},
{"id":"9","name":"Bánh rán","description":"Bánh rán is a deep-fried glutinous rice ball Vietnamese dish from northern Vietnam. In Vietnamese, bánh is a category of food including cakes, pies, and pastries, while rán means \"fried.\"","type":"food","type2":"fast food","countryId":"1","energy":"280","protein":"13","carbohydrate":"22","lipid":"21","allergy":"wheat,sesame"},
{"id":"10","name":"Bánh chưng","description":"Bánh chưng (Chữ Nôm: 餅蒸) is a traditional Vietnamese food which is made from glutinous rice, mung beans, pork and other ingredients.[1] Its origin is told by the legend of Lang Liêu, a prince of the last king of the Sixth Hùng Dynasty, who became the successor thanks to his creation of bánh chưng and bánh giầy, which symbolized, respectively, the earth and the sky. Considered an essential element of the family altar on the occasion of Tết, the making and eating of bánh chưng during this time is a well-preserved tradition of Vietnamese people. Beside the Tết holiday, bánh chưng is also eaten all year round as Vietnamese cuisine.","type":"food","type2":"","countryId":"1","energy":"265","protein":"23","carbohydrate":"26","lipid":"26","allergy":"beef"},
{"id":"11","name":"Nộm (gỏi)","description":"Gỏi (Nộm in Northern Vietnam) is the indigenous salad of Vietnamese cuisine.[1] It is to be distinguished from sa lát (from the French for salad), and sa lát Nga (\"Russian salad\") found in Western style restaurants.","type":"food","type2":"","countryId":"1","energy":"130","protein":"11","carbohydrate":"11","lipid":"16","allergy":"peanuts"},
{"id":"12","name":"Cháo","description":"Porridge is a dish that mainly uses rice and water when cooked by many ethnic groups in East Asia and Southeast Asia. For Vietnamese people, porridge is one of the two most common dishes: rice and porridge. In China porridge is called 粥 (Mandarin pronounced \"zhōu\", Cantonese read \"zuk\"; Sino-Vietnamese pronunciation is \"chuck\"); In Japan, porridge is written using the same letter 粥 but pronounced \"kayu\". Meanwhile, Thailand calls porridge joke, Malaysia uses bubur for porridge, Cambodia uses the word babar and the Philippines uses the word lugaw. The English version for porridge is congee. In some cases, porridge is translated into English as porridge, which means thick porridge, referring to the general \"porridge\" of both the West and the East, using ingredients from rice to flour, oats, etc. milk,","type":"food","type2":"","countryId":"1","energy":"250","protein":"23","carbohydrate":"14","lipid":"15","allergy":"beef,chicken"},
{"id":"13","name":"Cơm tấm","description":"Cơm tấm or com tam (US: \/kʌm təm\/; Vietnamese: [kəːm tə̌m]) is a Vietnamese dish made from rice with fractured rice grains. Tấm refers to the broken rice grains, while cơm refers to cooked rice.[1][2] Although there are varied names like cơm tấm Sài Gòn (Saigon-style broken rice), particularly for Saigon,[1] the main ingredients remain the same for most cases.","type":"food","type2":"","countryId":"1","energy":"301","protein":"34","carbohydrate":"28","lipid":"31","allergy":"beef"},
{"id":"14","name":"Rau muống xào","description":"Stir-fried water spinach is a common Asian vegetable dish, known by various names in Asian languages. Water spinach (Ipomoea aquatica) is stir-fried with a variety of vegetables, spices, and sometimes meats. It is commonly found throughout East, South and Southeast Asia; from Sichuan and Cantonese cuisine in China,[1] to Indonesian,[2] Burmese, Cambodian, Filipino, Malaysian, Singaporean, and Vietnamese cuisine in Southeast Asia; to Sri Lankan cuisine and Bengali cuisine in South Asia.","type":"food","type2":"","countryId":"1","energy":"198","protein":"13","carbohydrate":"12","lipid":"18","allergy":null},
{"id":"15","name":"Chả cá Lã Vọng","description":"Cha ca La Vong (Chả cá Lã Vọng in Vietnamese) is a Vietnamese grilled fish dish, originally from Hanoi.[1] The dish is traditionally made with hemibagrus (or ca lang in Vietnamese), which is a genus of catfish.[2] The fish is cut into pieces and marinated in a turmeric-based sauce, which often includes shrimp paste or fish sauce, ginger, and chili peppers. Sometimes, saffron is used instead of turmeric. It is then lightly grilled over charcoal. The dish is served in a hot pan coated with marinade sauce and herbs, particularly dill. Other herbs, such as scallions or basil, may be included. It is eaten with vermicelli rice noodles (bún in Vietnamese)[3] and peanuts.[1][4][5] Cha Ca La Vong is considered a delicacy in Vietnam, as it is nearly exclusively served in restaurants and is not found in street food.","type":"food","type2":"","countryId":"1","energy":"250","protein":"36","carbohydrate":"11","lipid":"27","allergy":null},
{"id":"16","name":"Cao lầu","description":"Cao lầu is a regional Vietnamese noodle dish, from the city of Hội An, in central Vietnam's Quảng Nam Province. It typically consists of pork and greens on a bed of rice noodles made from rice which has been soaked in lye water, giving them a characteristic texture and colour that sets the dish apart from other Vietnamese noodle dishes, including others from the same region, such as mì Quảng.","type":"food","type2":"","countryId":"1","energy":"278","protein":"26","carbohydrate":"27","lipid":"15","allergy":"wheat"},
{"id":"17","name":"Trứng vịt lộn","description":"Balut (\/bəˈluːt\/ bə-LOOT, \/ˈbɑːluːt\/ BAH-loot;[1] also spelled as balot) is a fertilized developing egg embryo that is boiled and eaten from the shell. It is commonly sold as street food in South China and Southeast Asian countries, notably the Philippines, Cambodia (Khmer: ពងទាកូន, paung tea kaun) and Vietnam (Vietnamese: trứng vịt lộn). The term comes from the Filipino language.","type":"food","type2":"fast food","countryId":"1","energy":"289","protein":"42","carbohydrate":"11","lipid":"27","allergy":null},
{"id":"18","name":"Sushi","description":"pronounced [sɯɕiꜜ] or [sɯꜜɕi]) is a Japanese dish of prepared vinegared rice (鮨飯, sushi-meshi), usually with some sugar and salt, accompanied by a variety of ingredients (ねた, neta), such as seafood, often raw, and vegetables. Styles of sushi and its presentation vary widely, but the one key ingredient is \"sushi rice\", also referred to as shari (しゃり), or sumeshi (酢飯, \"vinegared rice\")","type":"food","type2":"","countryId":"2","energy":"170","protein":"13","carbohydrate":"14","lipid":"9","allergy":null},
{"id":"19","name":"Okonomiyaki","description":"Okonomiyaki (Japanese: お好み焼き, (listen)) is a Japanese savory pancake dish consisting of wheat flour batter and other ingredients (mixed, or as toppings) cooked on a teppan (flat griddle). Common additions include cabbage, meat, and seafood, and toppings include okonomiyaki sauce (made with Worcestershire sauce), aonori (dried seaweed flakes), katsuobushi (bonito flakes), Japanese mayonnaise, and pickled ginger.","type":"food","type2":"","countryId":"2","energy":"201","protein":"21","carbohydrate":"21","lipid":"19","allergy":"wheat,shirmp"},
{"id":"20","name":"Yakitori","description":"Yakitori (Japanese: 焼き鳥) (literally 'grilled bird') is a Japanese type of skewered chicken. Its preparation involves skewering the meat with kushi (串), a type of skewer typically made of steel, bamboo, or similar materials. Afterwards, they are grilled over a charcoal fire. During or after cooking, the meat is typically seasoned with tare sauce or salt.[1] The term is sometimes used informally for kushiyaki (grilled and skewered foods) in general.","type":"food","type2":"fast food","countryId":"2","energy":"220","protein":"24","carbohydrate":"11","lipid":"23","allergy":"chicken"},
{"id":"21","name":"Udon","description":"Udon (うどん or 饂飩) is a thick noodle made from wheat flour, used in Japanese cuisine. It is a comfort food for many Japanese people. There are a variety of ways it is prepared and served. Its simplest form is in a hot soup as kake udon with a mild broth called kakejiru made from dashi, soy sauce, and mirin. It is usually topped with thinly chopped scallions. Other common toppings include prawn tempura, kakiage (mixed tempura fritter), abura-age (sweet, deep-fried tofu pouches), kamaboko (sliced fish cake), and shichimi spice added to taste.","type":"food","type2":"","countryId":"2","energy":"150","protein":"12","carbohydrate":"24","lipid":"11","allergy":"wheat"},
{"id":"22","name":"Takoyaki","description":"Takoyaki (たこ焼き or 蛸焼) is a ball-shaped Japanese snack made of a wheat flour-based batter and cooked in a special molded pan. It is typically filled with minced or diced octopus (tako), tempura scraps (tenkasu), pickled ginger (beni shoga), and green onion (negi).[1][2] The balls are brushed with takoyaki sauce (similar to Worcestershire sauce) and mayonnaise, and then sprinkled with green laver (aonori) and shavings of dried bonito (katsuobushi).","type":"food","type2":"fast food","countryId":"2","energy":"180","protein":"21","carbohydrate":"19","lipid":"12","allergy":"wheat"},
{"id":"23","name":"Soba","description":"Soba (そば or 蕎麦, \"buckwheat\") is a thin Japanese noodle made from buckwheat. The noodles are served either chilled with a dipping sauce, or hot in a noodle soup. The variety Nagano soba includes wheat flour.","type":"food","type2":"","countryId":"2","energy":"120","protein":"11","carbohydrate":"31","lipid":"12","allergy":"Soba"},
{"id":"24","name":"Sukiyaki","description":"Sukiyaki (鋤焼, or more commonly すき焼き; [sɯ̥kijaki]) is a Japanese dish that is prepared and served in the nabemono (Japanese hot pot) style.  It consists of meat (usually thinly sliced beef) which is slowly cooked or simmered at the table, alongside vegetables and other ingredients, in a shallow iron pot in a mixture of soy sauce, sugar, and mirin. The ingredients are usually dipped in a small bowl of raw, beaten eggs after being cooked in the pot, and then eaten.","type":"food","type2":"","countryId":"2","energy":"290","protein":"33","carbohydrate":"23","lipid":"28","allergy":"beef,peanuts"},
{"id":"25","name":"Sashimi","description":"Sashimi (刺身, English: \/səˈʃiːmi\/ sə-SHEE-mee, Japanese: [saɕimiꜜ]) is a Japanese delicacy consisting of fresh raw fish or meat sliced into thin pieces and often eaten with soy sauce.[1]","type":"food","type2":"","countryId":"2","energy":"110","protein":"19","carbohydrate":"9","lipid":"15","allergy":null},
{"id":"26","name":"Unagi","description":"Unagi (ウナギ) is the Japanese word for freshwater eel, especially the Japanese eel, Anguilla japonica (日本鰻, nihon unagi).[1] Unagi is a common ingredient in Japanese cooking, often as kabayaki. It is not to be confused with saltwater eel, which is known as anago in Japanese.","type":"food","type2":"","countryId":"2","energy":"270","protein":"36","carbohydrate":"15","lipid":"29","allergy":null},
{"id":"27","name":"Tofu","description":"Tofu (Chinese: 豆腐; pinyin: Dòufu), also known as bean curd in English, is a food prepared by coagulating soy milk and then pressing the resulting curds into solid white blocks of varying softness; it can be silken, soft, firm, extra firm or super firm. Beyond these broad textural categories, there are many varieties of tofu. It has a subtle flavor, so it can be used in savory and sweet dishes. It is often seasoned or marinated to suit the dish and its flavors, and due to its spongy texture, it absorbs flavors well.","type":"food","type2":"","countryId":"2","energy":"70","protein":"12","carbohydrate":"7","lipid":"4","allergy":null},
{"id":"28","name":"Onigiri","description":"Onigiri (お握り or 御握り), also known as omusubi (お結び), nigirimeshi (握り飯), or rice ball, is a Japanese food made from white rice formed into triangular or cylindrical shapes and often wrapped in nori.[a] Traditionally, an onigiri is filled with pickled ume (umeboshi), salted salmon, katsuobushi, kombu, tarako, mentaiko, takanazuke (pickled takana) or any other salty or sour ingredient as a natural preservative. Most Japanese convenience stores stock their onigiri with various fillings and flavors. There are even specialized shops which only sell onigiri to take out. Due to the popularity of this trend in Japan, onigiri has become a popular staple in Japanese restaurants worldwide.","type":"food","type2":"","countryId":"2","energy":"170","protein":"13","carbohydrate":"26","lipid":"12","allergy":null},
{"id":"29","name":"Wagashi","description":"Wagashi (和菓子, wa-gashi) are traditional Japanese confections that are often served with green tea, especially the types made of mochi, anko (azuki bean paste), and fruit. Wagashi are typically made from plant-based ingredients.[1]","type":"food","type2":"sweet","countryId":"2","energy":"190","protein":"9","carbohydrate":"17","lipid":"7","allergy":null},
{"id":"30","name":"Natto","description":"Nattō (納豆), spelled as natto in standard English language use, is a traditional Japanese food made from whole soybeans that have been fermented with Bacillus subtilis var. natto.[1] It is often served as a breakfast food, and often with rice.[2] It is served with karashi mustard, soy or tare sauce, and sometimes Japanese bunching onion. Within Japan, nattō is most popular in the eastern regions, including Kantō, Tōhoku, and Hokkaido.[3]","type":"food","type2":"","countryId":"2","energy":"29","protein":"9","carbohydrate":"12","lipid":"5","allergy":"peanuts"},
{"id":"31","name":"Tempura","description":"Tempura (天ぷら or 天麩羅, tenpura, [tempɯɾa]) is a typical Japanese dish usually consisting of seafood, meat and vegetables that have been battered and deep fried. The dish was introduced by the Portuguese in Nagasaki through the fritter-cooking techniques in the 16th century. The word ‘tempura’ comes from the Latin word tempora, a term referring to these times of fasting, when the church dictated that Catholics go meatless. [1]","type":"food","type2":"","countryId":"2","energy":"210","protein":"19","carbohydrate":"15","lipid":"12","allergy":"wheat,shirmp"},
{"id":"32","name":"Ramen","description":"Ramen (\/ˈrɑːmən\/) (拉麺, ラーメン, rāmen, IPA: [ɾaꜜːmeɴ]) is a Japanese noodle dish. It consists of Chinese-style wheat noodles (chūkamen) served in a meat-based broth, often flavored with soy sauce or miso, and uses toppings such as sliced pork (叉焼, chāshū), nori (dried seaweed), menma, and scallions. Ramen has its roots in Chinese noodle dishes:[1] nearly every region in Japan has its own variation of ramen, such as the tonkotsu (pork bone broth) ramen of Kyushu, and the miso ramen of Hokkaido. Mazemen is a ramen dish that is not served in a soup, but rather with a sauce (such as tare).","type":"food","type2":"","countryId":"2","energy":"288","protein":"21","carbohydrate":"27","lipid":"25","allergy":"wheat"},
{"id":"33","name":"Tonkatsu","description":"Tonkatsu (豚カツ, とんかつ or トンカツ, pronounced [toŋkatsɯ]; \"pork cutlet\") is a Japanese dish that consists of a breaded, deep-fried pork cutlet. It involves coating slices of pork with panko (bread crumbs), and then frying them in oil. The two main types are fillet and loin. Tonkatsu is also the basis of other dishes such as Katsukarē and katsudon.","type":"food","type2":"","countryId":"2","energy":"289","protein":"35","carbohydrate":"21","lipid":"32","allergy":"wheat"},
{"id":"34","name":"Kaiseki","description":"Kaiseki (懐石) or kaiseki-ryōri (懐石料理) is a traditional multi-course Japanese dinner. The term also refers to the collection of skills and techniques that allow the preparation of such meals and is analogous to Western haute cuisine.[1]","type":"food","type2":"","countryId":"2","energy":"135","protein":"18","carbohydrate":"17","lipid":"11","allergy":null},
{"id":"35","name":"Pizza Napoletana","description":"Neapolitan pizza (Italian: pizza napoletana), also known as Naples-style pizza, is a style of pizza made with tomatoes and mozzarella cheese. The tomatoes must be either San Marzano tomatoes or Pomodorino del Piennolo del Vesuvio, which grow on the volcanic plains to the south of Mount Vesuvius. The cheese must be Mozzarella di Bufala Campana, a protected designation of origin cheese made with the milk from water buffalo raised in the marshlands of Campania and Lazio in a semi-wild state, or Fior di Latte, a cow's milk mozzarella created according to the procedure for which it was registered as a Traditional Speciality Guaranteed (TSG).[1][2] Pizza Napoletana is a Traditional Speciality Guaranteed (TSG) product in the European Union and the United Kingdom, and the art of its making is included on UNESCO's list of intangible cultural heritage.[3]","type":"food","type2":"","countryId":"3","energy":"175","protein":"21","carbohydrate":"24","lipid":"13","allergy":"wheat"},
{"id":"36","name":"Polenta","description":"Polenta (\/pəˈlɛntə, poʊˈ-\/, Italian: [poˈlɛnta])[2][3] is a dish of boiled cornmeal that was historically made from other grains. The dish comes from Italy. It may be served as a hot porridge, or it may be allowed to cool and solidify into a loaf that can be baked, fried, or grilled.","type":"food","type2":"","countryId":"3","energy":"187","protein":"24","carbohydrate":"22","lipid":"12","allergy":"wheat"},
{"id":"37","name":"Ribollita","description":"Ribollita is a [1]: 36  Tuscan bread soup, panade, porridge, or potage made with bread and vegetables, often from leftovers.[2] There are many variations but the main ingredients always include leftover bread, cannellini beans, lacinato kale, cabbage, and inexpensive vegetables such as carrot, beans, chard, celery, potatoes, and onion. Its name means \"reboiled\".[1]: 36  It is often baked in a clay pot.[1]: 36 ","type":"food","type2":"","countryId":"3","energy":"232","protein":"25","carbohydrate":"23","lipid":"22","allergy":null},
{"id":"38","name":"Risotto","description":"Risotto (\/rɪˈzɒtoʊ\/, Italian: [riˈzɔtto, -ˈsɔt-], from riso meaning \"rice\")[1] is a northern Italian rice dish cooked with broth until it reaches a creamy consistency. The broth can be derived from meat, fish, or vegetables. Many types of risotto contain butter, onion, white wine, and Parmigiano-Reggiano. It is one of the most common ways of cooking rice in Italy. Saffron was originally used for flavour and its signature yellow colour.[2][3]","type":"food","type2":"","countryId":"3","energy":"256","protein":"25","carbohydrate":"23","lipid":"17","allergy":null},
{"id":"39","name":"Veal Milanese","description":"Veal Milanese, or veal alla Milanese (Italian: cotoletta alla milanese [kotoˈletta alla milaˈneːze, -eːse]; Milanese: co(s)toletta a la milanesa [ku(s)tuˈlɛta a la milaˈneːza]), is an Italian dish in Milanese Lombard cuisine, and a popular variety of cotoletta.[1] It is traditionally prepared with a veal rib chop or sirloin bone-in and made into a breaded cutlet, fried in butter. Due to its shape, it is often called oreggia d'elefant in Milanese or orecchia d'elefante in Italian, meaning elephant's ear.[2]","type":"food","type2":"","countryId":"3","energy":"245","protein":"23","carbohydrate":"25","lipid":"17","allergy":"chicken"},
{"id":"40","name":"OssoBuco","description":"Ossobuco or osso buco (pronounced [ˌɔssoˈbuːko]; Milanese: òss bus [ˌɔs ˈbyːz]) is a specialty of Lombard cuisine of cross-cut veal shanks braised with vegetables, white wine and broth. It is often garnished with gremolata and traditionally served with either risotto alla milanese or polenta, depending on the regional variation.[1] The marrow in the hole in the bone, a prized delicacy, is the defining feature of the dish.[2][3]","type":"food","type2":"","countryId":"3","energy":"267","protein":"25","carbohydrate":"13","lipid":"11","allergy":"beef"},
{"id":"41","name":"Bottarga","description":"Bottarga is a delicacy of salted, cured fish roe, typically of the grey mullet or the bluefin tuna (bottarga di tonno). The best-known version is produced around the Mediterranean; similar foods are the Japanese karasumi and Taiwanese wuyutsu, which is softer, and Korean eoran, from mullet or freshwater drum. It has many names and is prepared in various ways.","type":"food","type2":"","countryId":"3","energy":"223","protein":"25","carbohydrate":"33","lipid":"21","allergy":null},
{"id":"42","name":"Baccalà","description":"Dried and salted cod, sometimes referred to as salt cod or saltfish or salt dolly, is cod which has been preserved by drying after salting. Cod which has been dried without the addition of salt is stockfish. Salt cod was long a major export of the North Atlantic region, and has become an ingredient of many cuisines around the Atlantic and in the Mediterranean.","type":"food","type2":"","countryId":"3","energy":"256","protein":"34","carbohydrate":"25","lipid":"22","allergy":null},
{"id":"43","name":"Vitello Tonnato","description":"Vitello tonnato is a Piedmontese[citation needed] dish of cold, sliced veal covered with a creamy, mayonnaise-like sauce that has been flavored with tuna. It is served chilled or at room temperature,[1] generally in the summertime, as the main course of an Italian meal or as \"an exceedingly elegant antipasto for an elaborate dinner.\"[2] It is also very popular, by inheritance, in Argentina, where it is known by its original name in Piedmontese dialect Vitel tonnè, (spelled Vitel Toné or Thoné in Argentina) and considered a traditional Christmas dish.[3][4]","type":"food","type2":"","countryId":"3","energy":"278","protein":"23","carbohydrate":"24","lipid":"11","allergy":"milk"},
{"id":"44","name":"Canederli","description":"Knödel (pronounced [ˈknøːdl̩] (listen); sing. and pl.) or Klöße (pronounced [ˈkløːsə] (listen); sing. Kloß) are boiled dumplings[1] commonly found in Central European and East European cuisine. Central European countries in which their variant of Knödel is popular include Austria, Germany, Hungary, Poland, Romania, Bosnia, Croatia, Serbia, Slovenia, Slovakia, Bulgaria and Czechia. They are also found in Scandinavian, Romanian, North-eastern Italian cuisine, Ukrainian and Belarusian cuisines. Usually made from flour, bread[1] or potatoes,[1] they are often served as a side dish, but can also be a dessert such as plum dumplings, or even meat balls in soup. Many varieties and variations exist.","type":"food","type2":"","countryId":"3","energy":"267","protein":"23","carbohydrate":"21","lipid":"17","allergy":"wheat,beef"},
{"id":"45","name":"Ragù alla Bolognese","description":"Bolognese sauce (UK: \/ˌbɒləˈneɪz, -ˈnɛz\/, US: \/ˌboʊlənˈjeɪz, -ˈniz\/;[1] known in Italian as ragù alla bolognese, pronounced [raˈɡu alla boloɲˈɲeːse, -eːze], ragù bolognese, or simply ragù) is a meat-based sauce in Italian cuisine, typical of the city of Bologna. It is customarily used to dress tagliatelle al ragù and to prepare lasagne alla bolognese.","type":"food","type2":"","countryId":"3","energy":"267","protein":"23","carbohydrate":"21","lipid":"15","allergy":"wheat,beef"},
{"id":"46","name":"Bistecca Fiorentina","description":"The bistecca alla fiorentina (beefsteak Florentine style) is an Italian steak made of young steer (vitellone) or heifer (scottona) that, combined with the specific preparation, makes it one of the most popular dishes of Tuscan cuisine. It is a high cut including the bone, to be cooked on the embers or on the grill, with a degree of \"blood\" cooking (\"al sangue\").","type":"food","type2":"","countryId":"3","energy":"245","protein":"23","carbohydrate":"31","lipid":"11","allergy":"beef"},
{"id":"47","name":"Arancini","description":"Arancini (UK: \/ˌærənˈtʃiːni\/, US: \/ˌɑːr-\/,[1][2] Italian: [aranˈtʃiːni], Sicilian: [aɾanˈtʃiːnɪ, -ˈdʒiː-]) are Italian rice balls that are stuffed, coated with bread crumbs and deep fried, and are a staple of Sicilian cuisine ،its also similar to the arabic dish in the Levantine cuisine the kibbeh. The most common fillings are: al ragù or al sugo, filled with ragù (meat or mince, slow-cooked at low temperature with tomato sauce and spices), mozzarella or caciocavallo cheese, and often peas, and al burro or ô burru, filled with ham and mozzarella or besciamella.","type":"food","type2":"","countryId":"3","energy":"243","protein":"22","carbohydrate":"25","lipid":"21","allergy":"wheat"},
{"id":"48","name":"Melanzane alla Parmigiana","description":"Parmigiana (\/ˌpɑːrmɪˈdʒɑːnə, -ˈʒɑː-\/, Italian: [parmiˈdʒaːna]), also called parmigiana di melanzane [parmiˈdʒaːna di melanˈdzaːne; -ˈtsaːne], melanzane alla parmigiana [melanˈdzaːne; -ˈtsaːne ˌalla parmiˈdʒaːna], or eggplant parmesan, is an Italian dish made with fried, sliced eggplant layered with cheese and tomato sauce, then baked. The origin of the dish is claimed by the Southern regions of Calabria, Campania, and Sicily. Other variations found outside Italy may include chicken, veal, or another type of meat cutlet or vegetable filling.","type":"food","type2":"","countryId":"3","energy":"267","protein":"23","carbohydrate":"21","lipid":"17","allergy":"milk"},
{"id":"49","name":"Saltimbocca alla Romana","description":"Saltimbocca, also spelled saltinbocca (UK: \/ˌsæltɪmˈbɒkə, -ˈboʊkə\/, US: \/ˌsɔːl-\/, Italian: [ˌsaltimˈbokka]; Italian for ''[it] jump[s] in the mouth''), is an Italian dish (also popular in southern Switzerland). It consists of veal that has been wrapped (\"lined\") with prosciutto and sage, and then marinated in wine, oil, or saltwater, depending on the region or one's own taste.","type":"food","type2":"","countryId":"3","energy":"210","protein":"23","carbohydrate":"24","lipid":"22","allergy":"beef"},
{"id":"50","name":"Cacio e Pepe","description":"Cacio e pepe (Italian pronunciation: [ˈkaːtʃo e pˈpeːpe]) is a pasta dish from the cuisine of the city of Rome.[1] Cacio e pepe means \"cheese and pepper\" in several central Italian dialects. In keeping with its name, the dish contains grated Pecorino Romano cheese and black pepper, together with spaghetti,[1] or traditionally tonnarelli.[2] All the ingredients keep well for a long time, which made the dish practical for shepherds without fixed abode. Rough-surfaced pasta is recommended, to make the sauce adhere well.","type":"food","type2":"","countryId":"3","energy":"210","protein":"13","carbohydrate":"12","lipid":"11","allergy":"wheat"},
{"id":"51","name":"Spaghetti alle Vongole","description":"Spaghetti alle vongole (pronounced [spaˈɡetti alle ˈvoŋɡole]), Italian for \"spaghetti with clams\", is a dish that is very popular throughout Italy, especially in Campania (where it is part of traditional Neapolitan cuisine).","type":"food","type2":"","countryId":"3","energy":"210","protein":"25","carbohydrate":"24","lipid":"11","allergy":"wheat,milk"},
{"id":"52","name":"Lobster rolls","description":"A lobster roll is a dish native to New England. It is made of lobster meat served on a grilled hot dog-style bun. The filling may also contain butter, lemon juice, salt, black pepper, with variants made in some parts of New England replacing the butter with mayonnaise. Other versions may contain diced celery or scallion. Potato chips or french fries are the typical sides.[1]","type":"food","type2":"","countryId":"4","energy":"267","protein":"25","carbohydrate":"11","lipid":"31","allergy":null},
{"id":"53","name":"Buffalo wings","description":"A Buffalo wing in American cuisine is an unbreaded chicken wing section (flat or drumette) that is generally deep-fried and then coated or dipped in a sauce consisting of a vinegar-based cayenne pepper hot sauce and melted butter prior to serving.[3][4][5] They are traditionally served hot, along with celery sticks and carrot sticks with blue cheese dressing or, primarily outside of New York, ranch dressing for dipping. Buffalo wings are often called simply \"wings\", \"hot wings\", or \"chicken wings\".","type":"food","type2":"","countryId":"4","energy":"210","protein":"33","carbohydrate":"21","lipid":"32","allergy":"chicken"},
{"id":"54","name":"Barbecue ribs","description":"Ribs of pork, beef, lamb, and venison are a cut of meat. The term ribs usually refers to the less meaty part of the chops, often cooked as a slab (not cut into separate ribs). Ribs of bison, goat, ostrich, crocodile, alligator, llama, alpaca, beefalo, African buffalo, water buffalo, kangaroo, and other animals are also consumed in various parts of the world.  They can be roasted, grilled, fried, baked, braised, or smoked. A set of ribs served together (5 or more), is known as a rack (as in a rack of ribs).","type":"food","type2":"","countryId":"4","energy":"300","protein":"36","carbohydrate":"21","lipid":"33","allergy":"beef"},
{"id":"55","name":"BLT","description":"A BLT is a type of sandwich, named for the initials of its primary ingredients, bacon, lettuce, and tomato. It can be made with varying recipes according to personal preference. Simple variants include using different types of lettuce, toasting or not, or adding mayonnaise. More pronounced variants can include using turkey bacon or tofu in place of bacon, or removing the lettuce entirely.","type":"food","type2":"","countryId":"4","energy":"210","protein":"23","carbohydrate":"24","lipid":"22","allergy":"wheat"},
{"id":"56","name":"Apple pie","description":"An apple pie is a pie in which the principal filling ingredient is apples. The earliest printed recipe is from England. Apple pie is often served with whipped cream, ice cream (\"apple pie à la mode\"), or cheddar cheese.[3] It is generally double-crusted, with pastry both above and below the filling; the upper crust may be solid or latticed (woven of crosswise strips). The bottom crust may be baked separately (\"blind\") to prevent it from getting soggy. Deep-dish apple pie often has a top crust only. Tarte Tatin is baked with the crust on top, but served with it on the bottom.","type":"food","type2":"sweet","countryId":"4","energy":"250","protein":"13","carbohydrate":"24","lipid":"11","allergy":"wheat"},
{"id":"57","name":"Po' boy","description":"A po' boy (also po-boy, po boy) is a traditional sandwich from Louisiana. It almost always consists of meat, which is usually roast beef or fried seafood, often shrimp, crawfish, fish, oysters or crab. The meat is served on New Orleans French bread - known for its crisp crust and fluffy center.","type":"food","type2":"","countryId":"4","energy":"210","protein":"25","carbohydrate":"11","lipid":"21","allergy":"wheat,beef"},
{"id":"58","name":"Chicago-style pizza","description":"Chicago-style pizza is pizza prepared according to several different styles developed in Chicago, widely referred to simply as deep dish pizza due to its cooking style. The pan in which it is baked gives the pizza its characteristically high edge which provides ample space for large amounts of cheese and a chunky tomato sauce. Chicago-style pizza may be prepared in deep-dish style and as a stuffed pizza.","type":"food","type2":"","countryId":"4","energy":"267","protein":"27","carbohydrate":"26","lipid":"12","allergy":"wheat,milk"},
{"id":"59","name":"Nachos","description":"Nachos are a Mexican food consisting of fried tortilla chips or totopos covered with melted cheese or cheese sauce, as well as a variety of other toppings, often including meats (such as ground beef or grilled chicken), vegetables (such as chili peppers, lettuce, tomatoes, and olives), and condiments such as salsa or sour cream. At its most basic form, nachos may consist of merely chips covered with cheese, and served as an appetizer or snack, while other versions are substantial enough as a main course. The dish was created by, and named for, Ignacio Anaya, who created them in 1941 for customers at the Victory Club restaurant in Piedras Negras, Coahuila.","type":"food","type2":"","countryId":"4","energy":"267","protein":"25","carbohydrate":"12","lipid":"12","allergy":"milk"},
{"id":"60","name":"cheese steak","description":"A cheesesteak (also known as a Philadelphia cheesesteak, Philly cheesesteak, cheesesteak sandwich, cheese steak, or steak and cheese) is a sandwich made from thinly sliced pieces of beefsteak and melted cheese in a long hoagie roll.[1][2] A popular regional fast food, it has its roots in the U.S. city of Philadelphia, Pennsylvania.","type":"food","type2":"","countryId":"4","energy":"310","protein":"41","carbohydrate":"12","lipid":"37","allergy":"milk,beef"},
{"id":"61","name":"Hot dogs","description":"A hot dog[1][2] (less commonly spelled hotdog[3]) is a food consisting of a grilled or steamed sausage served in the slit of a partially sliced bun.[4] The term hot dog can also refer to the sausage itself. The sausage used is a wiener (Vienna sausage) or a frankfurter (Frankfurter Würstchen, also just called frank). The names of these sausages also commonly refer to their assembled dish.[5] Some consider a hot dog to technically be a sandwich. Hot dog preparation and condiments vary worldwide. Typical condiments include mustard, ketchup, mayonnaise, relish, and cheese sauce. Common garnishes include onions, sauerkraut, jalapeños, chili, grated cheese, coleslaw, bacon, and olives.[6] Hot dog variants include the corn dog and pigs in a blanket. The hot dog's cultural traditions include the Nathan's Hot Dog Eating Contest and the Oscar Mayer Wienermobile.","type":"food","type2":"fast food","countryId":"4","energy":"220","protein":"26","carbohydrate":"24","lipid":"21","allergy":"wheat"},
{"id":"62","name":"Reuben sandwich","description":"The Reuben sandwich is a North American grilled sandwich composed of corned beef, Swiss cheese, sauerkraut, and Thousand Island dressing or Russian dressing, grilled between slices of rye bread. It is associated with kosher-style delicatessens, but is not kosher because it combines meat and cheese.","type":"food","type2":"fast food","countryId":"4","energy":"170","protein":"18","carbohydrate":"15","lipid":"17","allergy":"wheat,beef"},
{"id":"63","name":"Cheeseburger","description":"A cheeseburger is a hamburger topped with cheese. Traditionally, the slice of cheese is placed on top of the meat patty. The cheese is usually added to the cooking hamburger patty shortly before serving, which allows the cheese to melt. Cheeseburgers can include variations in structure, ingredients and composition. As with other hamburgers, a cheeseburger may include toppings such as lettuce, tomato, onion, pickles, bacon, mayonnaise, ketchup, and mustard.","type":"food","type2":"fast food","countryId":"4","energy":"299","protein":"33","carbohydrate":"28","lipid":"27","allergy":"milk,beef"},
{"id":"64","name":"Cioppino","description":"Cioppino (\/tʃəˈpiːnoʊ\/, Italian: [tʃopˈpiːno]; from Ligurian: cioppin [tʃuˈpiŋ]) is a fish stew originating in San Francisco, California. It is an Italian-American dish and is related to various regional fish soups and stews of Italian cuisine.","type":"food","type2":"","countryId":"4","energy":"210","protein":"24","carbohydrate":"20","lipid":"16","allergy":null},
{"id":"65","name":"Tom Kha Gai","description":"Tom kha kai, tom kha gai, or Thai coconut soup[1][2][3] (Thai: ต้มข่าไก่, pronounced [tôm kʰàː kàj]; lit. 'chicken galangal soup') is a spicy and sour hot soup with coconut milk in Thai cuisine.","type":"food","type2":"","countryId":"5","energy":"210","protein":"27","carbohydrate":"12","lipid":"23","allergy":"chicken"},
{"id":"66","name":"Khao Pad","description":"Thai fried rice (Thai: ข้าวผัด, RTGS: khao phat, pronounced [kʰâ(ː)w pʰàt]) is a variety of fried rice typical of central Thai cuisine. In Thai, khao means \"rice\" and phat means \"of or relating to being stir-fried\".  This dish differs from Chinese fried rice in that it is prepared with Thai jasmine rice instead of regular long-grain rice. It normally contains meat (chicken, shrimp, and crab are all common), egg, onions, garlic and sometimes tomatoes. The seasonings, which may include soy sauce, sugar, salt, possibly some chili sauce, and the ubiquitous nampla (fish sauce), are stir-fried together with the other ingredients. The dish is then plated and served with accompaniments like cucumber slices, tomato slices, lime and sprigs of green onion and coriander, and phrik nampla, a spicy sauce made of sliced Thai chilies, chopped garlic cloves, fish sauce, lime juice and sugar.","type":"food","type2":"","countryId":"5","energy":"267","protein":"25","carbohydrate":"15","lipid":"21","allergy":"chicken,bean"},
{"id":"67","name":"Pad Thai","description":"Pad thai, phat thai, or phad thai (\/ˌpɑːd ˈtaɪ\/ or \/ˌpæd ˈtaɪ\/; Thai: ผัดไทย, RTGS: phat thai, ISO: p̄hạd thịy, pronounced [pʰàt tʰāj] (listen), 'Thai stir fry'), is a stir-fried rice noodle dish commonly served as a street food in Thailand as part of the country's cuisine.[1][2] It is typically made with rice noodles, shrimp, peanuts, a scrambled egg, and bean sprouts, among other vegetables. The ingredients are fried in a wok.","type":"food","type2":"","countryId":"5","energy":"210","protein":"23","carbohydrate":"11","lipid":"17","allergy":"shirmp,peanuts"},
{"id":"68","name":"Tom Yum Goong","description":"Tom yum or tom yam (UK: \/ˌtɒm ˈjæm, - ˈjʌm\/, US: \/- ˈjɑːm\/;[3] Thai: ต้มยำ, RTGS: tom yam [tôm jām] (listen)) is a type of hot and sour Thai soup,[3] usually cooked with shrimp (prawn).[4] Tom yum has its origin in Thailand.  The words \"tom yam\" are derived from two Thai words. Tom refers to the boiling process, while yam means 'mixed'. Tom yum is characterised by its distinct hot and sour flavours, with fragrant spices and herbs generously used in the broth. The soup is also made with fresh ingredients such as lemongrass, kaffir lime leaves, galangal, lime juice, fish sauce, and crushed red chili peppers. The tom yum seasoning has been investigated as a potential functional food and a natural antimicrobial because of its kaffir lime leaf and red chili content.[5]","type":"food","type2":"","countryId":"5","energy":"210","protein":"25","carbohydrate":"11","lipid":"16","allergy":"shirmp"},
{"id":"69","name":"Khao Niew Mamuang","description":"Mango sticky rice is a traditional Southeast Asian and South Asian dessert made with glutinous rice, fresh mango and coconut milk, and eaten with a spoon or the hands.[1]","type":"food","type2":"","countryId":"5","energy":"210","protein":"21","carbohydrate":"15","lipid":"17","allergy":null},
{"id":"70","name":"Khao Soi","description":"Khao soi or khao soy (Thai: ข้าวซอย, pronounced [kʰâ:w sɔ̄ːj]; Lao: ເຂົ້າຊອຍ [kʰȁw sɔ́ːj], Burmese: အုန်းနို့ခေါက်ဆွဲ ,pronounced [ʔóʊɴ no̰ kʰaʊʔ sʰwɛ́]) is a Chin Haw dish[1] served in Laos and northern Thailand.[2] A comparable dish, ohn no khao swè, is widely served in Myanmar. The name means 'cut rice', although it is possible that it is simply a corruption of the Burmese word for noodles – \"khao swè\" – which may account for the variations. Traditionally, the dough for the rice noodles is spread out on a cloth stretched over boiling water. After steaming the large sheet noodle is then rolled and cut with scissors. Lao khao soi is traditionally made with hand sliced rice noodles in clear soup broth and topped with minced pork and tomato sauce.[3] In some markets in Luang Namtha and Muang Sing vendors still hand cut the noodles. These traditionally cut noodles can also be found in several places in northern Thailand.","type":"food","type2":"","countryId":"5","energy":"250","protein":"25","carbohydrate":"21","lipid":"22","allergy":"chicken"},
{"id":"71","name":"Pad See Ew","description":"Pad see ew (phat si-io or pad siew, Thai: ผัดซีอิ๊ว, RTGS: phat si-io, pronounced [pʰàt sīːʔíw]) is a stir-fried noodle dish that is commonly eaten in Thailand.[1] It can be found easily among street food vendors and is also quite popular in Thai restaurants around the world. The origins of the dish can be traced to China from where the noodle stir-frying technique was brought.[2]  The dish is prepared in a wok which allows the black soy sauce added at the end of the cooking process to stick to the noodles for an exaggerated caramelizing and charring effect. The dish may look a little burnt, but the charred smoky flavor is the defining feature of the dish.[3]","type":"food","type2":"","countryId":"5","energy":"267","protein":"25","carbohydrate":"11","lipid":"15","allergy":"beef,bean"},
{"id":"72","name":"Laab Moo","description":"Larb (Lao: ລາບ; Thai: ลาบ, RTGS: lap, pronounced [lâːp], also spelled laap, larp, lahb or laab) is a type of Lao meat salad[1][2][3] that is the national dish of Laos,[4][5][6] along with green papaya salad[7] and sticky rice.[8] Larb is also eaten in other Southeast Asian countries where the Lao have migrated and extended their influence. Local variants of larb also feature in the cuisines of the Tai peoples of Shan State, Burma, and Yunnan Province, China.[9]","type":"food","type2":"","countryId":"5","energy":"250","protein":"18","carbohydrate":"11","lipid":"15","allergy":"chicken"},
{"id":"73","name":"Panang Curry","description":"Phanaeng (Thai: พะแนง, pronounced [pʰā.nɛ̄ːŋ]), also spelled phanang, panang, and other variants) is a type of red Thai curry that is thick, salty and sweet, with a zesty makrut lime flavour.[1] The earliest known mention of phanaeng appears in Mom Somchin Rachanupraphan's book Tamra Kap Khao (ตำรากับข้าว), published in 1890.[2]  A popular phanaeng curry dish is pork phanaeng.[citation needed] In Thailand, this curry is usually eaten with rice.","type":"food","type2":"","countryId":"5","energy":"250","protein":"26","carbohydrate":"11","lipid":"28","allergy":"shirmp"},
{"id":"74","name":"Som Tam","description":"Green papaya salad (Lao: ຕຳຫມາກຫຸ່ງ and Thai: ส้มตำ) is a spicy salad made from shredded unripe papaya, that possibly originated in Laos but nowadays is eaten throughout Continental Southeast Asia (Cambodia, Laos, Myanmar, Thailand, and Vietnam). The Thai variation som tam has been listed at number 46 on World's 50 most delicious foods[4] compiled by CNN Go in 2011[5] and 2018.[6] Papaya salad was featured as Laos' national costume at the Miss Grand International 2021 pageant.[7]","type":"food","type2":"","countryId":"5","energy":"232","protein":"25","carbohydrate":"12","lipid":"15","allergy":"bean"},
{"id":"75","name":"Tod Mun Pla","description":"In Thai cuisine, the fish is first mashed and then mixed with chopped yardlong beans,[29] fresh cilantro (including stalks), fish sauce,[30] kaffir lime leaves,[29] red curry paste,[31] and an egg binding.[30] This is deep-fried and usually served with a sweet chilli dipping sauce. Thot man pla have become popular around the world.","type":"food","type2":"","countryId":"5","energy":"220","protein":"23","carbohydrate":"15","lipid":"13","allergy":"wheat"},
{"id":"76","name":"Hoy Tod","description":"The oyster omelette, as known as o-a-tsian (Chinese: 蚵仔煎; Pe̍h-ōe-jī: ô-á-chian), o-chien (Chinese: 蚵煎; Pe̍h-ōe-jī: ô-chian) or orh luak (simplified Chinese: 蚝烙; traditional Chinese: 蠔烙; Peng'im: o5 luah4) is a dish of Hokkien and Teochew origin that is renowned for its savory flavor in its native Chaoshan and Minnan region, along with Taiwan and many parts of Southeast Asia such as the Philippines, Thailand, Malaysia and Singapore due to the influence of the Hokkien and Teochew diaspora. Variations of the dish exist in some southern regions of China.","type":"food","type2":"","countryId":"5","energy":"210","protein":"25","carbohydrate":"11","lipid":"21","allergy":"beef"},
{"id":"77","name":"Kuay Teow Reua","description":"Boat noodles (Thai: ก๋วยเตี๋ยวเรือ (kuaitiao ruea), pronounced [kǔa̯j.tǐa̯w rɯ̄a̯]) is a Thai style noodle dish with a strong flavor. It contains both pork and beef, as well as dark soy sauce, pickled bean curd, and some other spices, and is normally served with meatballs and pig's liver. The soup is seasoned with pig or cow blood mixed with salt and spices (เลือดหมูสด (lueat mu sot) or เลือดเนื้อสด (lueat nuea sot)). The colour of the soup is similar to beef noodle soup (ก๋วยเตี๋ยวเนื้อ (kuaitiao nuea pueay)) but considerably thicker due to the blood added. It is commonly served in a small bowl.  The other ingredients of boat noodles are garlic, fried garlic, radish, cinnamon, bean sprouts, parsley, morning glory, and some Thai chilli flakes. Type of the noodles for boat noodle are several, thin rice noodles, egg noodles, sen yai (เส้นใหญ่, literally – 'big noodles'), and sen lek (เส้นเล็ก, literally – 'small noodles').","type":"food","type2":"","countryId":"5","energy":"267","protein":"23","carbohydrate":"21","lipid":"15","allergy":"chicken"},
{"id":"78","name":"Mu Kratha","description":"Mu kratha (Thai: หมูกระทะ, RTGS: mu kratha, pronounced [mǔː krā.tʰáʔ]) is a Southeast Asian cooking method, originating in Thailand. In Philippines, Singapore and Malaysia, it is known as mookata.[1]","type":"food","type2":"","countryId":"5","energy":"220","protein":"13","carbohydrate":"12","lipid":"22","allergy":"beef"},
{"id":"79","name":"Bibimbap","description":"Bibimbap[1] (\/ˈbiːbɪmbæp\/ BEE-bim-bap,[2] from Korean 비빔밥 [pi.bim.p͈ap̚], literally \"mixed rice\"), sometimes romanized as bi bim bap or bi bim bop, is a Korean rice dish. The term \"bibim\" means mixing rice (burned rice at the bottom of the dish and cooked rice), while the \"bap\" noun refers to rice. Bibimbap is served as a bowl of warm white rice topped with namul (sautéed and seasoned vegetables) or kimchi (traditional fermented vegetables) and gochujang (chili pepper paste), soy sauce, or doenjang (a fermented soybean paste). A raw or fried egg and sliced meat (usually beef) are common additions. The hot dish is stirred together thoroughly just before eating.[3]","type":"food","type2":"","countryId":"6","energy":"210","protein":"25","carbohydrate":"11","lipid":"22","allergy":null},
{"id":"80","name":"Gimbap","description":"Gimbap (김밥), also romanized as kimbap, is a Korean dish made from cooked rice and ingredients such as vegetables, fish, and meats that are rolled in gim—dried sheets of seaweed—and served in bite-sized slices.[1][citation needed] The origins of gimbap are debated. Some sources suggest it originates from Japanese norimaki, introduced during Japanese colonial rule,[2][3][4][5] while others[who?] argue it is a modernized version of bokssam from the Joseon era. Regardless, it has since become a distinct dish.[6] The dish is often part of a packed meal, or dosirak, to be eaten at picnics and outdoor events, and can serve as a light lunch along with danmuji (yellow pickled radish) and kimchi. It is a popular take-out food in South Korea and abroad[7] and is known as a convenient food because of its portability.","type":"food","type2":"","countryId":"6","energy":"170","protein":"13","carbohydrate":"21","lipid":"17","allergy":null},
{"id":"81","name":"Tteokguk","description":"Tteokguk[2] (떡국) or sliced rice cake soup[2] is a traditional Korean dish eaten during the celebration of the Korean New Year. The dish consists of the broth\/soup (guk) with thinly sliced rice cakes (tteok). It is tradition to eat tteokguk on New Year's Day because it is believed to grant the people good luck for the year and gain a year of age. It is usually garnished with thin julienned cooked eggs, marinated meat, gim (김),[3] and sesame oil (참기름).","type":"food","type2":"","countryId":"6","energy":"220","protein":"13","carbohydrate":"15","lipid":"17","allergy":null},
{"id":"82","name":"Japchae","description":"Japchae (잡채; 雜菜) is a savory and slightly sweet dish of stir-fried glass noodles and vegetables that is popular in Korean cuisine.[1] Japchae is typically prepared with dangmyeon (당면, 唐麵), a type of cellophane noodles made from sweet potato starch; the noodles are mixed with assorted vegetables, meat, mushrooms, and seasoned with soy sauce and sesame oil.[2][3][4][5]  Once a royal dish, japchae is now one of the most popular traditional celebration dishes, often served on special occasions, such as weddings, birthdays (especially dol, the first birthday, and hwangap, the sixtieth), and holidays.[6][5][7] It is also popular at banquets, parties, and potlucks, due to the ease of bulk preparation and flexible serving: japchae can be served warm, at room temperature, or cold from the refrigerator, and can be eaten freshly made or the day after.[3][4]","type":"food","type2":"","countryId":"6","energy":"210","protein":"13","carbohydrate":"15","lipid":"17","allergy":null},
{"id":"83","name":"Naengmyeon","description":"Naengmyeon[2] (냉면; 冷麵, in South Korea) or raengmyŏn (랭면, in North Korea) is a noodle dish of Northern Korean origin which consists of long and thin handmade noodles made from the flour and starch of various ingredients, including buckwheat (메밀, memil), potatoes, sweet potatoes, arrowroot starch (darker color and chewier than buckwheat noodles), and kudzu (칡, chik). Buckwheat predominates (despite the name, it is not a wheat but rather is more closely related to sorrel). Other varieties of naengmyeon are made from ingredients such as seaweed and green tea.","type":"food","type2":"","countryId":"6","energy":"267","protein":"23","carbohydrate":"11","lipid":"21","allergy":null},
{"id":"84","name":"Kimchi Jjigae","description":"Kimchi-jjigae[1] (김치찌개) or kimchi stew[1] is a jjigae, or stew-like Korean dish, made with kimchi and other ingredients, such as pork or seafood, scallions, onions, and diced dubu. It is one of the most common stews in Korean cuisine.","type":"food","type2":"","countryId":"6","energy":"120","protein":"13","carbohydrate":"11","lipid":"7","allergy":null},
{"id":"85","name":"Samgyetang","description":"Samgye-tang (삼계탕; 蔘鷄湯) or ginseng chicken soup,[1] meaning ginseng (Kor. sam) - chicken (Kor. gye) - soup (Kor. tang) in Korean, consists primarily of a whole young chicken (poussin) filled with garlic, rice, jujube, and ginseng.[3] Samgye-tang is a Korean traditional soup for body health.[4] Samgye-tang is a representative summer health food. Soup made with chicken that is slightly larger than the chick is called Yeonggye Baeksuk, and the chicken is divided into half is called Banggye-tang.","type":"food","type2":"","countryId":"6","energy":"210","protein":"11","carbohydrate":"12","lipid":"11","allergy":null},
{"id":"86","name":"Sundubu Jjigae","description":"Sundubu-jjigae[1] (순두부찌개, -豆腐--) or soft tofu stew[1] is a jjigae (찌개, Korean stew) in Korean cuisine. The dish is made with freshly curdled soft tofu (which has not been strained and pressed), vegetables, sometimes mushrooms, onion, optional seafood (commonly oysters, mussels, clams and shrimp), optional meat (commonly beef or pork), and gochujang (chili paste) or gochu garu (chili powder). The dish is assembled and cooked directly in the serving vessel, which is traditionally made of thick, robust porcelain, but can also be ground out of solid stone. A raw egg can be put in the jjigae just before serving, and the dish is delivered while bubbling vigorously. It is typically eaten with a bowl of cooked white rice and several banchan (side dishes).[2]","type":"food","type2":"","countryId":"6","energy":"170","protein":"11","carbohydrate":"11","lipid":"15","allergy":null},
{"id":"87","name":"Gamjatang","description":"Gamja-tang[1] (감자탕) or pork back-bone stew[1] is a spicy Korean soup made from the spine or neck bones of a pig. It often contains potatoes, cellophane noodles, dried radish greens, perilla leaves, green onions, hot peppers and ground sesame seeds.[2]  The vertebrae are usually separated with bits of meat clinging to them. The vertebrae are boiled at high temperatures to soften the meat. To remove the meat, one must use an instrument such as a chopstick. The meal is usually served with kimchi and a bowl of rice. This food is served as a lunch or dinner and often as a late-night snack, as well.","type":"food","type2":"","countryId":"6","energy":"160","protein":"12","carbohydrate":"11","lipid":"14","allergy":null},
{"id":"88","name":"Galbijjim","description":"Galbi-jjim[1] (갈비찜) or braised short ribs[1] is a variety of jjim or Korean steamed dish made with galbi (갈비, short rib). Beef galbi is sometimes referred to as \"gari\" (가리), so the dish can be called \"garijjim\".[2] Galbijjim is generally made with beef or pork (돼지, dweji) short ribs. In the latter case, it is called dweji galbijjim (돼지갈비찜).","type":"food","type2":"","countryId":"6","energy":"140","protein":"11","carbohydrate":"9","lipid":"11","allergy":null},
{"id":"89","name":"Bulgogi","description":"Bulgogi (불고기; \/bʊlˈɡoʊɡiː\/ bool-GOH-gee;[2] from Korean bul-gogi [pul.ɡo.ɡi]), literally \"fire meat\", is a gui (구이; Korean-style grilled or roasted dish) made of thin, marinated slices of beef or pork grilled on a barbecue or on a stove-top griddle. It is also often stir-fried in a pan in home cooking. Sirloin, rib eye or brisket are frequently used cuts of beef for the dish. The dish originated from northern areas of the Korean Peninsula, but is a very popular dish in South Korea, where it can be found anywhere from upscale restaurants to local supermarkets as pan-ready kits.","type":"food","type2":"","countryId":"6","energy":"210","protein":"11","carbohydrate":"12","lipid":"11","allergy":null},
{"id":"90","name":"Samgyeopsal","description":"Samgyeopsal (삼겹살; lit. 'three-layer meat'), samgyeopsal-gui (삼겹살구이 lit. 'grilled three-layer meat'), or grilled pork belly is a type of gui (grilled dish) in Korean cuisine.","type":"food","type2":"","countryId":"6","energy":"210","protein":"25","carbohydrate":"11","lipid":"21","allergy":null},
{"id":"91","name":"Chicken","description":"Korean fried chicken, usually called chikin (치킨, from the English \"chicken\") in Korea, refers to a variety of fried chicken dishes created in South Korea, including the basic huraideu-chicken (후라이드 치킨, from the English \"fried chicken\") and spicy yangnyeom chicken (양념 치킨, \"seasoned chicken\").[1] In South Korea, fried chicken is consumed as a meal, an appetizer, anju (food that is served and eaten with drinks), or as an after-meal snack.","type":"food","type2":"","countryId":"6","energy":"289","protein":"25","carbohydrate":"11","lipid":"28","allergy":"chicken"},
{"id":"92","name":"Bossam","description":"Bossam (보쌈, 褓-) is a pork dish in Korean cuisine. It usually consists of pork shoulder that is boiled in spices and thinly sliced.[1] The meat is served with side dishes such as spicy radish salad, sliced raw garlic, ssamjang (wrap sauce), saeu-jeot (salted shrimp), kimchi, and ssam (wrap) vegetables such as lettuce, kkaennip (perilla leaves), and inner leaves of a napa cabbage.[2][3]  Bossam is a popular dish in South Korea, often served as anju (i.e. food accompanying alcoholic drinks).[4] To eat, the meat and side dishes are wrapped together in ssam vegetables, hence the literal meaning of bossam: \"wrapped\" or \"packaged\".","type":"food","type2":"","countryId":"6","energy":"210","protein":"13","carbohydrate":"9","lipid":"15","allergy":null},
{"id":"93","name":"Haemul Pajeon","description":"Pajeon (파전, Korean pronunciation: [pʰa.dʑʌn]) is a variety of jeon with scallion as its prominent ingredient, as pa (파) means scallion. It is a Korean dish made from a batter of eggs, wheat flour, rice flour, scallions, and often other ingredients depending on the variety. Beef, pork, kimchi, shellfish, and other seafood are mostly used.[1] If one of these ingredients, such as squid, dominates the jeon, the name will reflect that; ojing'eo jeon (오징어전) is 'squid jeon.  Pajeon is usually recognizable by the highly visible scallions. It is similar to a Chinese scallion pancake in appearance; however, unlike the Chinese dish (but like Western pancakes), it is made from a liquid batter and thus has a lighter texture.","type":"food","type2":"","countryId":"6","energy":"220","protein":"13","carbohydrate":"15","lipid":"11","allergy":null},
{"id":"94","name":"Ganjang Gejang","description":"Gejang (게장) or gejeot (게젓) is a variety of jeotgal, salted fermented seafood in Korean cuisine, which is made by marinating fresh raw crabs either in ganjang (soy sauce) or in a sauce based on chili pepper powder. The term consists of the two words; ge, meaning \"a crab\", and jang which means \"condiment\" in Korean.[1] Although gejang originally referred only to crabs marinated in soy sauce, it has begun to be called \"ganjang gejang\"(간장게장) these days to differentiate it from yangnyeom-gejang (양념게장). The latter is a relatively new dish that emerged since the restaurant industry began to thrive in South Korea.[2] \"Yangnyeom\" literally means \"seasoning\" or \"seasoned\" in Korean but refers to the spicy sauce made with chili pepper powder.","type":"food","type2":"","countryId":"6","energy":"250","protein":"13","carbohydrate":"12","lipid":"15","allergy":null},
{"id":"95","name":"Nakji Bokkeum","description":"Nakji-bokkeum[1] (낙지볶음) or stir-fried octopus[1] is a popular dish in Korea that is relatively recent, with origins dating back only two centuries and first being introduced in 1965.","type":"food","type2":"","countryId":"6","energy":"250","protein":"23","carbohydrate":"21","lipid":"17","allergy":null},
{"id":"96","name":"Hotteok","description":"Hotteok (Korean: 호떡; Hanja: 胡떡, pronounced [ho.t͈ʌk̚]), sometimes called Hoeddeok, is a type of filled pancake; and is a popular street food in South Korea. It originates in Korean Chinese cuisine, when it was first brought into Korea from China during the 19th century.","type":"food","type2":"","countryId":"6","energy":"187","protein":"11","carbohydrate":"21","lipid":"12","allergy":null},
{"id":"97","name":"Tteokbokki","description":"Tteokbokki (떡볶이), or simmered rice cake, is a popular Korean food made from small-sized garae-tteok (long, white, cylinder-shaped rice cakes) called tteokmyeon (떡면; \"rice cake noodles\") or commonly tteokbokki-tteok (떡볶이 떡; \"tteokbokki rice cakes\").[1][2] Eomuk (fish cakes), boiled eggs, and scallions are some common ingredients paired with tteokbokki in dishes. It can be seasoned with either spicy gochujang (chili paste) or non-spicy ganjang (soy sauce)-based sauce; the former is the most common form,[3] while the latter is less common and sometimes called gungjung-tteokbokki (royal court tteokbokki).","type":"food","type2":"","countryId":"6","energy":"190","protein":"11","carbohydrate":"15","lipid":"15","allergy":null},
{"id":"98","name":"Soondae","description":"Sundae (Korean: 순대 [sun.dɛ], sometimes anglicized as soondae) is a type of blood sausage in Korean cuisine.[1][2] It is a popular street food in both North and South Korea,[3][4] generally made by steaming cow or pig's intestines stuffed with various ingredients.","type":"food","type2":"","countryId":"6","energy":"210","protein":"25","carbohydrate":"15","lipid":"22","allergy":null},
{"id":"99","name":"Banchan","description":"Banchan (\/ˈbɑːnˌtʃɑːn\/,[1] from Korean: 반찬; 飯饌; banchan [pan.tɕʰan]) or bansang is a collective name for small side dishes served along with cooked rice in Korean cuisine. As the Korean language does not distinguish between singular and plural grammatically, the word is used for both one such dish or all of them combined.  The basic table setting for a meal called bansang (반상) usually consists of bap (밥, cooked rice), guk or tang (soup), gochujang or ganjang, jjigae, and kimchi. According to the number of banchan added, the table setting is called 3 cheop (삼첩), 5 cheop (오첩), 7 cheop (칠첩), 9 cheop (구첩), 12 cheop (십이첩) bansang, with the 12 cheop used in Korean royal cuisine.","type":"food","type2":"","countryId":"6","energy":"170","protein":"13","carbohydrate":"15","lipid":"15","allergy":null},
{"id":"100","name":"Poke","description":"Poke \/poʊˈkeɪ\/ (Hawaiian for \"to slice\" or \"cut crosswise into pieces\";[3][4] sometimes anglicised as 'poké' to aid pronunciation[5][6][7]) is diced raw fish served either as an appetizer or a main course and is one of the main dishes of Native Hawaiian cuisine. Traditional forms are aku (skipjack tuna) and heʻe (octopus). Heʻe poke is sometimes called tako poke in places where the Hawaiian language is not spoken. [8] Poke differs from other raw fish dishes in that it does not use citrus fruits as a curing agent.","type":"food","type2":"","countryId":"7","energy":"210","protein":"25","carbohydrate":"12","lipid":"22","allergy":null},
{"id":"101","name":"Chicken long rice","description":"This tasty comfort food is made with chicken, rice noodles, and vegetables, and it’s perfect for a quick and easy meal.  You can find chicken long rice at most local restaurants in Hawaii. So if you’re planning a trip to Hawaii, be sure to add chicken long rice to your list of must-try Hawaiian dishes!","type":"food","type2":"","countryId":"7","energy":"300","protein":"25","carbohydrate":"24","lipid":"21","allergy":"chicken"},
{"id":"102","name":"Lomi-Lomi salmon","description":"Lomi salmon (more commonly known as lomi-lomi salmon) is a side dish in Hawaiian cuisine. It is a fresh tomato and salmon salad, and was introduced to Hawaiians by early Western sailors.[1] It is typically prepared by mixing salted, shredded salmon with tomatoes, sweet Maui onions, and occasionally scallions, and sometimes crushed ice if it is not refrigerated. It is always served cold.  The name lomi-lomi salmon is taken from the method of preparation. The shredding (dicing) and mixing of the salmon is done by massaging the salted fish with other ingredients by hand (lomi-lomi is Hawaiian for \"to massage\").","type":"food","type2":"","countryId":"7","energy":"210","protein":"25","carbohydrate":"15","lipid":"17","allergy":null},
{"id":"103","name":"Laulau","description":"Laulau, otherwise known as Lū in Tonga, Palusami in Fiji and Samoa and Rukau in the Cook Islands, is a Polynesian dish consisting of cooked taro leaves containing fillings such as pork, fish or coconut cream. In old Hawaiʻi, laulau was assembled by taking a few leaves and placing a few pieces of fish and pork in the center. In modern times, the dish uses taro leaves, salted butterfish, and either pork, beef, or chicken and is usually steamed on the stove. Laulau is a typical plate lunch dish and is usually served with a side of rice and macaroni salad.","type":"food","type2":"","countryId":"7","energy":"250","protein":"13","carbohydrate":"12","lipid":"17","allergy":null},
{"id":"104","name":"Poi","description":"Poi or Popoi is a traditional staple food in the Polynesian diet, made from starchy vegetables, usually breadfruit, taro or plantain.  Traditional poi is produced by mashing cooked starch on a wooden pounding board, with a carved pestle made from basalt, calcite, coral or wood. Modern methods use an industrial food processor to produce large quantities for retail distribution. Water is added to the starch during mashing, and again just before eating, to achieve the desired consistency, which can range from highly viscous to liquid. In Hawaii, this is classified as either \"one-finger\", \"two-finger\", or \"three-finger\", alluding to how many fingers are required to scoop it up (the thicker the poi, the fewer fingers required to scoop a sufficient mouthful).[","type":"food","type2":"","countryId":"7","energy":"220","protein":"13","carbohydrate":"21","lipid":"11","allergy":null},
{"id":"105","name":"Saimin","description":"Saimin is a noodle soup dish common in the contemporary cuisine of Hawaii. Traditionally consisting of soft wheat egg noodles served in a hot dashi garnished with diced green onions and a thin slice of kamaboko, modern versions of saimin include additional toppings such as char siu, sliced Spam, sliced egg, or shredded nori. When Chinese dumplings are added to the noodle soup, it is seen on menus as the heartier wonton min. All saimin establishments have their own, often secret recipe for the soup base, but primarily use kombu and dried shrimp as major ingredients. Common table condiments mixed in the saimin broth are Chinese hot mustard and soy sauce, added in small quantities according to each individual's taste. Many local residents of Hawaii also enjoy barbecued teriyaki beef sticks (skewers) or American hamburgers as a side dish.","type":"food","type2":"","countryId":"7","energy":"250","protein":"23","carbohydrate":"15","lipid":"12","allergy":null},
{"id":"106","name":"Loco moco","description":"Loco moco is a dish featured in contemporary Hawaiian cuisine. There are many variations, but the traditional loco moco consists of white rice, topped with a hamburger, a fried egg, and brown gravy. Variations may include bacon, ham, Spam, tofu, kalua pork, Portuguese sausage, teriyaki beef, teriyaki chicken, mahi-mahi, shrimp, oysters, and other meats.","type":"food","type2":"","countryId":"7","energy":"220","protein":"13","carbohydrate":"12","lipid":"21","allergy":null},
{"id":"107","name":"Haupia","description":"Haupia is a traditional coconut milk-based Hawaiian dessert often found at luaus and other local gatherings in Hawaii. Since the 1940s, it has become popular as a topping for white cake, especially at weddings. Although technically considered a pudding, the consistency of haupia closely approximates gelatin dessert and it is usually served in blocks like gelatin. it is also served in local ice cream parlors as Haupia Ice Cream.","type":"food","type2":"","countryId":"7","energy":"250","protein":"25","carbohydrate":"11","lipid":"17","allergy":null},
{"id":"108","name":"Spam Musubi","description":"Spam musubi is a snack and lunch food composed of a slice of grilled Spam sandwiched either in between or on top of a block of rice, wrapped together with nori in the tradition of Japanese onigiri.  Inexpensive and portable, Spam musubi are commonly found near cash registers in convenience stores or mom-and-pop shops all over Hawaii, Guam and Hawaiian Barbecue restaurants in the mainland United States.[1] Musubi can be easily made with the right materials, and typically only uses spam, rice, some salt, nori and shoyu (soy sauce). In Hawaii, musubi made from homemade spam is served on catering trays at formal events by celebrity chefs such as Alan Wong at his exclusive restaurants.","type":"food","type2":"","countryId":"7","energy":"210","protein":"23","carbohydrate":"21","lipid":"17","allergy":"beef"},
{"id":"109","name":"Guava Cake","description":"This traditional treat is made with fresh guavas, sugar, butter, flour, eggs, and baking powder.  The sweet, fluffy dessert is easy to make and can be enjoyed by both adults and children alike. It’s something new to try while in Hawaii.","type":"food","type2":"","countryId":"7","energy":"267","protein":"11","carbohydrate":"15","lipid":"12","allergy":null},
{"id":"110","name":"Hawaii Mac Salad","description":" It’s a staple at any potluck or barbecue, and it’s often served as a side dish with fish or chicken.  While the ingredients may vary by recipe, most versions of this dish include elbow macaroni, mayo, mustard, and diced celery and onion. Some people also add shredded ham or bacon to the mix.","type":"food","type2":"","countryId":"7","energy":"110","protein":"11","carbohydrate":"9","lipid":"9","allergy":null},
{"id":"111","name":"Hawaiian Beef Teriyaki","description":"This dish is made with marinated beef that is grilled and served with a delicious teriyaki sauce, rice, and vegetables.  Hawaiian beef teriyaki food experience offers some of the best flavors Hawaii has to offer.","type":"food","type2":"","countryId":"7","energy":"350","protein":"37","carbohydrate":"14","lipid":"33","allergy":"beef"},
{"id":"112","name":"Hawaiian Grilled Teriyaki Chicken","description":"Hawaiian Chicken Grilled Teriyaki which features chicken that has been marinated in a soy and pineapple-based sauce and grilled to perfection.  The juicy, tender chicken is the perfect meal for lunch or dinner and pairs well with rice and vegetables. It’s a great way to enjoy the flavors of Hawaii!","type":"food","type2":"","countryId":"7","energy":"330","protein":"33","carbohydrate":"16","lipid":"35","allergy":"chicken"},
{"id":"113","name":"Taro Chips","description":"Taro Ko Farm Chips are made from 100% taro and are a delicious and healthy snack choice while in Hawaii.  The Taro Chips are made of four simple ingredients: Sweet potatoes, garlic salt, soybean oil, and li hing mui powder.","type":"food","type2":"","countryId":"7","energy":"280","protein":"13","carbohydrate":"18","lipid":"25","allergy":null},
{"id":"114","name":"Hawaiian Acai Bowls","description":"This antioxidant-rich dish is made with açai purée, bananas, and other fresh fruits or vegetables. It’s perfect for breakfast, lunch, or a snack on the go.  The açai bowl is quickly becoming one of the most popular breakfast and snack items in Hawaii. Made with açaí purée, bananas, and other fresh fruits or vegetables, this dish is not only delicious but also packed with antioxidants.","type":"food","type2":"","countryId":"6","energy":"220","protein":"23","carbohydrate":"11","lipid":"17","allergy":null},
{"id":"115","name":"Huli Huli Chicken","description":"Huli-huli chicken is a grilled chicken dish in Hawaiian cuisine, prepared by barbecuing a chicken over mesquite wood, and basting it with a sweet huli-huli sauce.","type":"food","type2":"","countryId":"7","energy":"289","protein":"25","carbohydrate":"15","lipid":"28","allergy":"chicken"},
{"id":"116","name":"Luau Stew","description":"Luau Stew is a traditional Hawaiian food. This hearty stew is made with chicken, pork, taro root, mushrooms, and sweet potatoes. It’s the perfect comfort food for cool weather days.  Taro roots are tuberous vegetable that grows in tropical climates, and they have a starchy texture and a nutty flavor. Mushrooms are used in the stew to add depth of flavor, and they can be replaced with other vegetables if desired.The chicken can be replaced with pork or beef if desired. This stew is hearty, flavorful, and nutritious.","type":"food","type2":"","countryId":"7","energy":"267","protein":"23","carbohydrate":"21","lipid":"15","allergy":null},
{"id":"117","name":"Kalua Pork","description":"Kālua is a traditional Hawaiian cooking method that utilizes an imu, a type of underground oven. The word \"kālua\" (\"to cook in an underground oven\" in the Hawaiian language) may also be used to describe the food cooked in this manner, such as kālua pig or kālua turkey, which are commonly served at lūʻau feasts. The word lūʻau is the Hawaiian name for the taro leaf, which, when young and small resembles cooked spinach after being steamed for a few hours. The traditional lūʻau was eaten on the floor over lauhala mats (leaves of the hala tree woven together).","type":"food","type2":"","countryId":"7","energy":"250","protein":"23","carbohydrate":"15","lipid":"11","allergy":null},
{"id":"118","name":"Bratwurst","description":"Bratwurst (German: [ˈbʁaːtvʊɐ̯st] (listen)) is a type of German sausage made from pork or, less commonly, beef or veal. The name is derived from the Old High German Brätwurst, from brät-, finely chopped meat, and Wurst, sausage, although in modern German it is often associated with the verb braten, to pan fry or roast.[1] Beef and veal are usually incorporated amongst a blend often including pork.","type":"food","type2":"","countryId":"8","energy":"250","protein":"23","carbohydrate":"12","lipid":"11","allergy":null},
{"id":"119","name":"Sauerkraut","description":"Sauerkraut (\/ˈsaʊ.ərkraʊt\/; German: [ˈzaʊɐˌkʁaʊt] (listen), lit. \"sour cabbage\"[1]) is finely cut raw cabbage that has been fermented by various lactic acid bacteria.[2][3] It has a long shelf life and a distinctive sour flavor, both of which result from the lactic acid formed when the bacteria ferment the sugars in the cabbage leaves.[4][5] It is one of the best-known national dishes in Germany.  Although in English-speaking countries it is known under its German name, it is also widely known in Eastern Europe and other places (see below). For example in Russia \"k`islaya kap`usta\" (кислая капуста) or \"kv`ashenaya kap`usta\" (квашеная капуста) has been a traditional and ubiquitous dish from ancient times.","type":"food","type2":"","countryId":"8","energy":"220","protein":"13","carbohydrate":"9","lipid":"21","allergy":null},
{"id":"120","name":"Schnitzel","description":"A schnitzel is a thin slice of meat. The meat is usually thinned by pounding with a meat tenderizer. Most commonly, the meat is breaded before frying. Breaded schnitzel is popular in many countries and is made using veal, pork, chicken, mutton, beef, or turkey. Schnitzel is very similar to the dish escalope in France, tonkatsu in Japan, cotoletta in Italy, kotlet schabowy in Poland, milanesa in Argentina, chuleta valluna in Colombia, and chicken-fried steak and pork tenderloin of the United States.","type":"food","type2":"","countryId":"8","energy":"250","protein":"23","carbohydrate":"21","lipid":"21","allergy":null},
{"id":"121","name":"Spätzle","description":"Spätzle ([ˈʃpɛtslə] (listen)) is a type of small noodle or dumpling[1] made with eggs, typically serving as a side for meat dishes with gravy. Commonly associated with Swabia, it is also found in the cuisines of southern Germany and Austria, Switzerland, Hungary, Slovenia, Alsace, Moselle and South Tyrol.","type":"food","type2":"","countryId":"8","energy":"220","protein":"23","carbohydrate":"12","lipid":"12","allergy":null},
{"id":"122","name":"Schwarzwälder Kirschtorte","description":"Black Forest gâteau or Black Forest cake (American English) is a chocolate sponge cake with a rich cherry filling based on the German dessert Schwarzwälder Kirschtorte (pronounced [ˈʃvaʁt͡svɛldɐ ˈkɪʁʃˌtɔʁtə]), literally \"Black Forest Cherry-torte\".  Typically, Black Forest gateau consists of several layers of chocolate sponge cake sandwiched with whipped cream and cherries. It is decorated with additional whipped cream, maraschino cherries, and chocolate shavings. In some European traditions, sour cherries are used both between the layers and for decorating the top.[2] Traditionally, kirschwasser, a clear spirit made from sour cherries, is added to the cake.[3] Other spirits are sometimes used, such as rum, which is common in Austrian recipes. German law mandates that any dessert labeled Schwarzwälder Kirschtorte must have kirschwasser.","type":"food","type2":"","countryId":"8","energy":"220","protein":"23","carbohydrate":"12","lipid":"12","allergy":null},
{"id":"123","name":"Apfelstrudel","description":"Apple strudel (German: Apfelstrudel; Czech: štrúdl; Yiddish: שטרודל) is a traditional Viennese strudel, a popular pastry in Austria, Bavaria, the Czech Republic, Northern Italy, Slovenia, and other countries in Europe that once belonged to the Austro-Hungarian Empire (1867–1918).","type":"food","type2":"","countryId":"8","energy":"267","protein":"23","carbohydrate":"15","lipid":"22","allergy":null},
{"id":"124","name":"Pflaumenkuchen","description":"Look no further than pflaumenkuchen! It is made with plums, sugar, butter, eggs, and flour.This traditional German cake is made with bread dough (yeast dough or shortcrust dough), thinly spread onto a baking sheet or other baking mold. This plum cake is a popular dessert in Germany.  It’s then covered with pitted zwetschgen plums – providing a sweet and tart flavor that is simply irresistible. Pflaumenkuchen is the perfect addition to any party or gathering – so be sure to pick some up today! This plum cake is a popular dessert in Germany.","type":"food","type2":"","countryId":"8","energy":"267","protein":"25","carbohydrate":"12","lipid":"21","allergy":null},
{"id":"125","name":"Streuselkuchen","description":"Streuselkuchen (German pronunciation: [ˈʃtʁɔʏzl̩ˌkuːxn̩]; \"crumb cake\"), also known in English-speaking countries as crumb cake, is a cake made of yeast dough covered with a sweet crumb topping referred to as streusel.[1] The main ingredients for the crumbs are sugar, butter, and flour,[1] which are mixed at a 1:1:2 ratio. The recipe allegedly originated in the region of Silesia,[2][3] and is popular in German, Polish and Ashkenazi Jewish cuisines.  A streuselkuchen is usually a flat cake made on a baking tray and cut into oblong pieces. It should be very flat - about one inch - with crumbs making up about half of its height. The original version uses yeast dough, however a short crust is possible. A puff pastry at the bottom turns it into a prasselkuchen.","type":"food","type2":"","countryId":"8","energy":"289","protein":"25","carbohydrate":"21","lipid":"28","allergy":null},
{"id":"126","name":"Rotkohl","description":"Rotkohl, or red cabbage, is absolutely delicious! It is a type of cabbage that gets its color from the anthocyanin pigments in the leaves.This red cabbage dish is a popular side dish in Germany. It usually cooks with onions, apples, and bacon.  This superfood is not only delicious but also good for you. Red cabbage is full of vitamins and minerals, making it a great addition to your diet. So go ahead and enjoy some Rotkohl today!","type":"food","type2":"","countryId":"8","energy":"289","protein":"23","carbohydrate":"15","lipid":"25","allergy":null},
{"id":"127","name":"Käsespätzle","description":"Käsespätzle (German for \"spätzle with cheese\", also called Käsknöpfle in Vorarlberg and Liechtenstein or Kasnocken in Tyrol) is a traditional dish of the German regions of Swabia, Baden and Allgäu, and also in the Austrian regions Vorarlberg and Tyrol, as well as Liechtenstein and Switzerland.","type":"food","type2":"","countryId":"8","energy":"278","protein":"23","carbohydrate":"21","lipid":"25","allergy":null},
{"id":"128","name":"Schweinebraten","description":"Als Schweinsbraten (süddeutsch, österreichisch, schweizerisch) bzw. Schweinebraten bezeichnet man gebratene und geschmorte Stücke des Hausschweins. Typische Bratenstücke sind Nacken (Schopf), Rücken (Karree), Schulter und Schinken.","type":"food","type2":"","countryId":"8","energy":"267","protein":"23","carbohydrate":"12","lipid":"21","allergy":null},
{"id":"129","name":"Schweinshaxe","description":"It is a popular dish in Germany.This delicious dish is made with pork knuckles that are roasted until they are nice and crispy. Schweinshaxe is the perfect dish for a cold winter day – it will warm you right up!","type":"food","type2":"","countryId":"8","energy":"250","protein":"25","carbohydrate":"21","lipid":"22","allergy":null},
{"id":"130","name":"Labskaus","description":"Lobscouse or (lapskaus) is a thick Norwegian stew made of meat and potatoes.[1][2] In northern Germany, Labskaus (listen (help·info)) is a culinary speciality, in particular from the cities of Bremen, Hamburg, and Lübeck. The main ingredients are salted meat or corned beef, potatoes, and onion. Some recipes put beetroot, pickled gherkin, or even herring into it, while others have these ingredients as side dishes.","type":"food","type2":"","countryId":"8","energy":"267","protein":"25","carbohydrate":"24","lipid":"22","allergy":null},
{"id":"131","name":"Wurstsalat","description":"Wurstsalat (German, literally sausage salad) is a tart sausage salad prepared with distilled white vinegar, oil and onions.[1][2] A variation of the recipe adds strips of pickled gherkin. It is normally made from a sort of boiled sausage like Lyoner, stadtwurst, Regensburger Wurst (two types of cooked sausage) or extrawurst. It is a traditional snack in southern Germany, Alsace, Switzerland and Austria, where in Austria it is called Saure Wurst.  To prepare the dish, the sausage is cut into thin slices or strips and placed, along with raw onion rings or cubes, in a vinegar and oil marinade, lightly seasoned with salt, pepper, and sometimes paprika.[1] Common additional ingredients are finely cut gherkins, radishes, parsley or chives. Wurstsalat is normally served with bread and sometimes also with fried potatoes.","type":"food","type2":"","countryId":"8","energy":"267","protein":"23","carbohydrate":"15","lipid":"22","allergy":"beef"},
{"id":"132","name":"Sauerbraten","description":"Sauerbraten is a traditional German roast of heavily marinated meat. It is regarded as a national dish of Germany, and is frequently served in German-style restaurants internationally.[1] It can be prepared from a variety of meats, most often from beef, but also from venison, lamb and mutton, pork and horse.[2][3][4] Before cooking, the raw meat is marinated for three to ten days in a mixture of vinegar or wine, water, herbs, spices, and seasonings. Usually, tougher cuts of meat, such as rump roast or bottom round of beef, are used, and the long marinating tenderizes the meat. A Sauerbraten dinner is almost always accompanied by a hearty gravy resulting from its roasting and is most often served with potato pancakes (Kartoffelpuffer), potato dumplings (Kartoffelklöße), or Spätzle.","type":"food","type2":"","countryId":"8","energy":"267","protein":"25","carbohydrate":"24","lipid":"22","allergy":null},
{"id":"133","name":"Currywurst","description":"Currywurst (German: [ˈkœʁiˌvʊɐ̯st] (listen)[1]) is a fast food dish of German origin consisting of steamed, fried sausage, usually pork (German: Bratwurst), typically cut into bite-sized chunks and seasoned with curry ketchup, a sauce based on spiced ketchup or tomato paste topped with curry powder, or a ready-made ketchup seasoned with curry and other spices. The dish is often served with fries.","type":"food","type2":"","countryId":"8","energy":"250","protein":"23","carbohydrate":"24","lipid":"15","allergy":null},
{"id":"134","name":"Leberkäse","description":"Leberkäse (help·info) (German, literally means 'liver-cheese'; sometimes spelled Leberkäs or Leberka(a)s in Austria and the Swabian, Bavarian and Franconian parts of Germany, 'leverkaas' in the Netherlands and Fleischkäse (\"meat-cheese\") in Saarland, Baden, Switzerland and Tyrol, is a specialty food found in the south of Germany, in Austria and parts of Switzerland, similar to bologna sausage. It consists of corned beef, pork and bacon and is made by grinding the ingredients very finely and then baking it as a loaf in a bread pan until it has a crunchy brown crust. Variations may be made of other meats such as horse meat or turkey, or may contain additional ingredients such as cheese or minced chili pepper.","type":"food","type2":"","countryId":"8","energy":"250","protein":"25","carbohydrate":"24","lipid":"11","allergy":null},
{"id":"135","name":"Maultaschen","description":"Maultaschen (singular Maultasche (listen), lit. 'mouth bags') are a kind of large meat-filled dumpling in Swabian cuisine. They consist of sheets of pasta dough filled with minced meat, smoked meat, spinach, bread crumbs and onions and flavored with various herbs and spices (e.g. pepper, parsley and nutmeg). Maultaschen are typically 8–12 centimetres (3–4+1⁄2 inches) across. They are square or rectangular in shape.  On 22 October 2009, the European Union recognized Maultaschen (Schwäbische Maultaschen or Schwäbische Suppenmaultaschen) as a \"regional specialty\" and remarked that the dish is significant to the cultural heritage of Baden-Württemberg.[1] This measure provides protection to the integrity of the dish, mandating that genuine Maultaschen are only produced in Swabia, a historical region that was incorporated into the modern German states of Baden-Württemberg and Bavaria.","type":"food","type2":"","countryId":"8","energy":"250","protein":"23","carbohydrate":"12","lipid":"22","allergy":null},
{"id":"136","name":"Rote Grütze","description":"Rødgrød (Danish: [ˈʁœðˀˌkʁœðˀ] (listen)), rote Grütze (German: [ˈʁoːtə ˈɡʁʏtsə] (listen)), or rode Grütt (Low Saxon: [ˈroʊdə ˈɡrʏt] (listen)), meaning \"red groats\", is a sweet fruit dish from Denmark and Northern Germany. The name of the dish in Danish features many of the elements that make Danish pronunciation difficult for non-native speakers, so rødgrød med fløde, literally \"red porridge with cream\", is a commonly used shibboleth since the early 1900s.","type":"food","type2":"","countryId":"8","energy":"220","protein":"25","carbohydrate":"11","lipid":"15","allergy":null},
{"id":"137","name":"Potato Pancakes","description":"Potato pancakes are shallow-fried pancakes of grated or ground potato, matzo meal or flour and a binding ingredient such as egg or applesauce, often flavored with grated garlic or onion and seasoning. They may be topped with a variety of condiments, ranging from the savory (such as sour cream or cottage cheese), to the sweet (such as apple sauce or sugar), or they may be served plain. The dish is sometimes made from mashed potatoes to make pancake-shaped croquettes.[1] Some variations are made with sweet potatoes.","type":"food","type2":"","countryId":"8","energy":"267","protein":"13","carbohydrate":"28","lipid":"21","allergy":null},
{"id":"138","name":"Hamburger Pannfisch","description":"Hamburger Pannfisch is a popular dish in Germany. It consists of fish fillets, eggs, bread crumbs, and onions. This delicious dish is perfect for any occasion and makes a great addition to any meal.Hamburger Pannfisch may use with any type of fish, but cod or haddock are the most popular. So if you’re looking for a delicious and easy seafood dish, look no further than Hamburger Pannfisch!","type":"food","type2":"","countryId":"8","energy":"289","protein":"25","carbohydrate":"21","lipid":"28","allergy":null},
{"id":"139","name":"Tarte Flambée","description":"Flammekueche (Alsatian), or tarte flambée (French), is a specialty of the region of Alsace.[1] It is composed of bread dough rolled out very thinly in the shape of a rectangle or oval, which is covered with fromage blanc or crème fraîche, thin-sliced onions and lardons.   Tarte flambée – fresh out of the oven The name of the dishes varies in local dialects; it is called Flàmmeküeche,[2] or Flàmmaküacha in Alsatian, or Flammkuche in Lorraine Franconian - compare (standard-)German Flammkuchen. All these names translate as \"pie baked in the flames\". Contrary to what the direct translation would suggest, tarte flambée is not flambéed but is cooked in a wood-fire oven.","type":"food","type2":"","countryId":"8","energy":"267","protein":"21","carbohydrate":"21","lipid":"21","allergy":null},
{"id":"140","name":"Königsberger Meatballs","description":"Königsberger meatballs, or Klops, are a popular dish in Germany. They contain ground beef, pork, bread crumbs, and eggs. Königsberger meatballs typically come with a white sauce or gravy.This delicious dish is perfect for any occasion, and makes a great addition to any meal. So if you’re looking for a delicious and easy way to use up ground beef, look no further than Königsberger meatballs!","type":"food","type2":"","countryId":"8","energy":"267","protein":"23","carbohydrate":"15","lipid":"17","allergy":null},
{"id":"141","name":"Stuffed Cabbage Filled with Millet","description":"Stuffed cabbage, or Kohlrouladen, is a popular dish in Germany. It consists of cabbage leaves, ground beef, bacon, and onions. This delicious dish is perfect for any occasion and makes a great addition to any meal.Stuffed cabbage may contain any type of cabbage, but the most popular are green cabbage or Savoy cabbage. So if you’re looking for a delicious and easy way to use up cabbage, look no further than stuffed cabbage!","type":"food","type2":"","countryId":"8","energy":"267","protein":"23","carbohydrate":"12","lipid":"11","allergy":null}
]
}